; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem problem2) (:domain p1)
(:objects 
    drone1 - drone
    crate1 - crate
    crate2 - crate
    crate3 - crate
    person1 - person
    person2 - person
    room1 warehouse depot - location
    food medicine - content
    left right - arm
)

(:init
    (person-at person1 room1)
    (person-at person2 room1)
    (crate-at crate1 warehouse)
    (crate-at crate2 warehouse)
    (crate-at crate3 warehouse)
    (content-crate food crate1)
    (content-crate medicine crate2)
    (content-crate food crate3)
    (drone-at drone1 depot)
    (empty-arm drone1 left)
    (empty-arm drone1 right)
)

(:goal (and
   (has-content-person person1 food)
   (has-content-person person2 medicine)
))

)

; plan
1. (drone-move depot warehouse drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 warehouse)
   goals met: 0 of 2
2. (pick-up-crate crate1 warehouse drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate1 warehouse)
   added: (has-crate-drone-arm drone1 right crate1)
   goals met: 0 of 2
3. (pick-up-crate crate2 warehouse drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 warehouse)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 0 of 2
4. (drone-move warehouse room1 drone1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 room1)
   goals met: 0 of 2
5. (drop-crate room1 person1 crate1 right food drone1)
   deleted: (has-crate-drone-arm drone1 right crate1)
   added: (has-content-person person1 food) (empty-arm drone1 right)
   goals met: 1 of 2
6. (drop-crate room1 person2 crate2 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person2 medicine) (empty-arm drone1 left)
   goals met: 2 of 2
